app/controllers/index_controller.rb

INSERT INTO "telemetries" ("latitude", "longitude", "altitude", "gps_quality", "hdop", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["latitude", 10.0], ["longitude", 20.0], ["altitude", 1000.0], ["gps_quality", 3], ["hdop", 1.2], ["created_at", "2019-12-09 21:56:34.252419"], ["updated_at", "2019-12-09 21:56:34.252419"]]
---
    def inData
        # save data in DB
        t = Telemetry.new
        t.latitude = params[:latitude]
        t.longitude = params[:longitude]
        t.altitude = params[:altitude]
        t.gps_quality = params[:gps_quality]
        t.hdop = params[:hdop]
        t.save